In [1]:
#pip install mysql-connector-python

import pandas as pd
import numpy as np
import mysql.connector

In [2]:
db = mysql.connector.connect(host='localhost', user='root', password='****')

In [3]:
cursor = db.cursor()

In [4]:
try:
    cursor.execute("CREATE DATABASE Python10")
except:
    db.rollback()

In [5]:
cursor.execute("SHOW DATABASES")
for x in cursor:
  print(x)

('dbms',)
('information_schema',)
('market',)
('mysql',)
('office',)
('performance_schema',)
('python10',)
('python10miniproject',)
('pythonexpt10',)
('sys',)
('testdb',)

In [6]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="****",
  database="python10"
)

In [7]:
cursor.execute('USE python10')

In [8]:
df=pd.read_excel('01_District_wise_crimes_committed_IPC_2001_2012.xlsx')
df1=df[['STATE','DISTRICT','YEAR','MURDER']]

In [9]:
df1=df1.head(5)
df1.head()

            STATE       DISTRICT  YEAR  MURDER
0  ANDHRA PRADESH       ADILABAD  2001     101
1  ANDHRA PRADESH      ANANTAPUR  2001     151
2  ANDHRA PRADESH       CHITTOOR  2001     101
3  ANDHRA PRADESH       CUDDAPAH  2001      80
4  ANDHRA PRADESH  EAST GODAVARI  2001      82

In [10]:
ls=df1.values.tolist()
print(ls)

[['ANDHRA PRADESH', 'ADILABAD', 2001, 101], ['ANDHRA PRADESH', 'ANANTAPUR', 2001, 151], ['ANDHRA PRADESH', 'CHITTOOR', 2001, 101], ['ANDHRA PRADESH', 'CUDDAPAH', 2001, 80], ['ANDHRA PRADESH', 'EAST GODAVARI', 2001, 82]]

In [11]:
try:
    cursor.execute("CREATE TABLE crime (STATE VARCHAR(50), DISTRICT VARCHAR(50),YEAR INT, MURDER INT)")
except:
    db.rollback()

In [12]:
cursor.execute("SHOW TABLES")
for x in cursor:
  print(x)

('crime',)

In [14]:
sql = "INSERT INTO crime(STATE, DISTRICT, YEAR, MURDER) VALUES (%s, %s, %s, %s)"
val = ls
cursor.executemany(sql, val)

In [15]:
mydb.commit()
print(cursor.rowcount, "was inserted.")

5 was inserted.

In [16]:
cursor = db.cursor(buffered=True)

In [18]:
cursor.execute("SELECT * FROM crime")
result = cursor.fetchall()
for x in result:
  print(x)

('ANDHRA PRADESH', 'ADILABAD', 2001, 101)
('ANDHRA PRADESH', 'ANANTAPUR', 2001, 151)
('ANDHRA PRADESH', 'CHITTOOR', 2001, 101)
('ANDHRA PRADESH', 'CUDDAPAH', 2001, 80)
('ANDHRA PRADESH', 'EAST GODAVARI', 2001, 82)

In [19]:
sql = "DELETE FROM crime WHERE MURDER <= 100"
cursor.execute(sql)
mydb.commit()
print(cursor.rowcount, "record(s) deleted")

2 record(s) deleted

In [20]:
cursor.execute("SELECT * FROM crime")
result = cursor.fetchall()
for x in result:
  print(x)

('ANDHRA PRADESH', 'ADILABAD', 2001, 101)
('ANDHRA PRADESH', 'ANANTAPUR', 2001, 151)
('ANDHRA PRADESH', 'CHITTOOR', 2001, 101)